In [2]:
a = 56

In [3]:
a

56

In [4]:
a = "this is python"
a

'this is python'

In [5]:
a = " this is good"
print(type(a))

<class 'str'>

In [6]:
a = "this is good"
print(a[2])

i

In [7]:
a = "this is good"
print(a[0:4:1])

this

In [8]:
print(a[::-1])

doog si siht

In [9]:
data = ["om","hari","kitu"]
print(data)

['om', 'hari', 'kitu']

In [10]:
data.append("d5")
print(data)

['om', 'hari', 'kitu', 'd5']

In [11]:
data.pop()
print(data)

['om', 'hari', 'kitu']

In [12]:
data.insert(1,"d6")
print(data)

['om', 'd6', 'hari', 'kitu']

In [13]:
data.extend([1,2,3])
print(data)

['om', 'd6', 'hari', 'kitu', 1, 2, 3]

In [14]:
data = ["om","hari","shree",[1,2,3],"kitu","tanu"]
print(data)

['om', 'hari', 'shree', [1, 2, 3], 'kitu', 'tanu']

In [15]:
data[3][1]="d7"
print(data)

['om', 'hari', 'shree', [1, 'd7', 3], 'kitu', 'tanu']

In [16]:
d2 = "om","shree","tanu"
print(d2)

('om', 'shree', 'tanu')

In [17]:
A = list(d2)
print(A)

['om', 'shree', 'tanu']

In [18]:
data2={1,2,2,3,0,4,5,6,6,7,8,9}
print(data2)

{0, 1, 2, 3, 4, 5, 6, 7, 8, 9}

In [19]:
data2.add("d5")
print(data2)

{0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 'd5'}

In [20]:
K ={"name":"ketki",
    "age":"21",
    "city":"pune"

}

In [21]:
print(K)

{'name': 'ketki', 'age': '21', 'city': 'pune'}

In [22]:
K.popitem()
print(K)

{'name': 'ketki', 'age': '21'}

In [23]:
K["age"]=22
print(K)

{'name': 'ketki', 'age': 22}

In [24]:
K["Div"]="A"
print(K)

{'name': 'ketki', 'age': 22, 'Div': 'A'}

In [25]:
K.update({"Div":"B"})
print(K)

{'name': 'ketki', 'age': 22, 'Div': 'B'}

In [26]:
a = 7
b = 7

if a > b:
    print("a is greater than b")
elif a == b:
    print(" a is equal to b")
else:
    print(" a is smaller than b")

 a is equal to b

In [27]:
num_1 = int(input("enter your first number:"))
num_2 = float(input("enter your second number:"))


a = 5
b = 6

if a > b:
    print(" a is smaller than b")
elif a == b:
    print("a is equal to b")
else:
    print("not valid")

ValueError: invalid literal for int() with base 10: ''

In [ ]:
num_1 = int(input("enter first number:"))

operation = str(input("enter opeartion----------->(+,-,*,/)"))

num_2 = float(input("enter second number:"))


print(num_1)

print(operation)

print(num_2)

if operation == "+":
    print("result:",num_1+num_2)
elif operation == "-":
    print("result:",num_1-num_2)
elif operation == "*":
    print("result:",num_1*num_2)
elif operation == "/":
    print("result:",num_1/num_2)
else:
    print("not valid")

3
+
4.0
result: 7.0

In [ ]:
import numpy as np

In [ ]:
data = np.array(["om","kk","pp","hh"])

In [ ]:
print(data)

['om' 'kk' 'pp' 'hh']

In [ ]:
print(data.ndim)

1

In [ ]:
print(data.size)

4

In [ ]:
print(data.shape)

(4,)

In [ ]:
data = np.array([[1,2,3],[4,5,6]])

In [ ]:
print(data)

[[1 2 3]
 [4 5 6]]

In [ ]:
print(data.ndim)

2

In [ ]:
print(data.shape)

(2, 3)

In [ ]:
import pandas as pd

In [ ]:
k = {"name":["om","shiv","tanu","pihu"],
     "age":[21,13,14,18],
     "city":["pune","mumbai","delhi","ngp"]

}

In [ ]:
print(k)

{'name': ['om', 'shiv', 'tanu', 'pihu'], 'age': [21, 13, 14, 18], 'city': ['pune', 'mumbai', 'delhi', 'ngp']}

In [ ]:
k = pd.DataFrame(k)
print(k)

   name  age    city
0    om   21    pune
1  shiv   13  mumbai
2  tanu   14   delhi
3  pihu   18     ngp

In [ ]:
k2 = {"age":[21,13,14,18],
      "grade":["a","b","c","d"]

}

In [ ]:
print(k2)

{'age': [21, 13, 14, 18], 'grade': ['a', 'b', 'c', 'd']}

In [ ]:
k2 = pd.DataFrame(k2)
print(k2)

   age grade
0   21     a
1   13     b
2   14     c
3   18     d

In [ ]:
data_all =pd.merge(k,k2)

In [ ]:
print(data_all)

   name  age    city grade
0    om   21    pune     a
1  shiv   13  mumbai     b
2  tanu   14   delhi     c
3  pihu   18     ngp     d

In [1]:
import pandas as pd

In [70]:
de = pd.read_excel(r"C:\Users\ketki\OneDrive\Desktop\excel\data_1.xlsx")

In [71]:
de

,Name,Age,Email,Join_Date,Salary,Department
0,John Doe,29,john@example.com,2021-06-15 00:00:00,50000,Sales
1,Jane Smith,NaN,jane.smith@mail.com,2020-12-06 00:00:00,52000,HR
2,Bob,35,bobmail.com,2022-08-15 00:00:00,"$48,000",marketing
3,Alice Lee,27,alice@lee.com,2020-11-01 00:00:00,46000,HR
4,NaN,41,eric@domain.com,2022-05-19 00:00:00,51000,Finance
5,Mark X,38,markx@example.com,NaN,54000,SALES
6,Tim Cook,-,tim@apple.com,2021-01-01 00:00:00,NaN,Tech
7,Lara Croft,33,NaN,2019-03-25 00:00:00,49000,archaeology
8,Jack Ryan,29,jack@ryan.com,2020-03-03 00:00:00,52000,Intelligence
9,Nina,25,nina@,2021-08-08 00:00:00,47000,HR
10,John Doe,29,john@example.com,2021-06-15 00:00:00,50000,Sales
11,Mike,abc,mike@mail.com,07/14/2022,50000,Engineering
12,NaN,NaN,NaN,NaN,NaN,NaN
13,Sam,32,sam@sam.com,2020-01-20 00:00:00,48000,SALES
14,Ben,45,ben@example.com,2021-07-15 00:00:00,51000,sales
15,Linda,NaN,linda@workplace.com,2022.09.09,53000,Tech
16,Gary,31,gary@nowhere.com,2020-10-10 00:00:00,fifty-two,HR
17,Clark,37,clark@kent.com,2023-01-15 00:00:00,57000,Superheroes
18,Diana,28,diana@themyscira.com,2021-05-05 00:00:00,56000,Superheroes
19,Peter,30,peter@parker.com,2020-12-12 00:00:00,51000,NaN

In [72]:
de.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        18 non-null     object
 1   Age         17 non-null     object
 2   Email       18 non-null     object
 3   Join_Date   18 non-null     object
 4   Salary      18 non-null     object
 5   Department  18 non-null     object
dtypes: object(6)
memory usage: 1.1+ KB

In [74]:
de.isnull().sum()

Name          2
Age           3
Email         2
Join_Date     2
Salary        2
Department    2
dtype: int64

In [75]:
de["Age"] = pd.to_numeric(de["Age"],errors="coerce")

In [76]:
de

,Name,Age,Email,Join_Date,Salary,Department
0,John Doe,29.0,john@example.com,2021-06-15 00:00:00,50000,Sales
1,Jane Smith,NaN,jane.smith@mail.com,2020-12-06 00:00:00,52000,HR
2,Bob,35.0,bobmail.com,2022-08-15 00:00:00,"$48,000",marketing
3,Alice Lee,27.0,alice@lee.com,2020-11-01 00:00:00,46000,HR
4,NaN,41.0,eric@domain.com,2022-05-19 00:00:00,51000,Finance
5,Mark X,38.0,markx@example.com,NaN,54000,SALES
6,Tim Cook,NaN,tim@apple.com,2021-01-01 00:00:00,NaN,Tech
7,Lara Croft,33.0,NaN,2019-03-25 00:00:00,49000,archaeology
8,Jack Ryan,29.0,jack@ryan.com,2020-03-03 00:00:00,52000,Intelligence
9,Nina,25.0,nina@,2021-08-08 00:00:00,47000,HR
10,John Doe,29.0,john@example.com,2021-06-15 00:00:00,50000,Sales
11,Mike,NaN,mike@mail.com,07/14/2022,50000,Engineering
12,NaN,NaN,NaN,NaN,NaN,NaN
13,Sam,32.0,sam@sam.com,2020-01-20 00:00:00,48000,SALES
14,Ben,45.0,ben@example.com,2021-07-15 00:00:00,51000,sales
15,Linda,NaN,linda@workplace.com,2022.09.09,53000,Tech
16,Gary,31.0,gary@nowhere.com,2020-10-10 00:00:00,fifty-two,HR
17,Clark,37.0,clark@kent.com,2023-01-15 00:00:00,57000,Superheroes
18,Diana,28.0,diana@themyscira.com,2021-05-05 00:00:00,56000,Superheroes
19,Peter,30.0,peter@parker.com,2020-12-12 00:00:00,51000,NaN

In [77]:
de["Age"]=de["Age"].fillna(de["Age"].mean())

In [78]:
de

,Name,Age,Email,Join_Date,Salary,Department
0,John Doe,29.0,john@example.com,2021-06-15 00:00:00,50000,Sales
1,Jane Smith,32.6,jane.smith@mail.com,2020-12-06 00:00:00,52000,HR
2,Bob,35.0,bobmail.com,2022-08-15 00:00:00,"$48,000",marketing
3,Alice Lee,27.0,alice@lee.com,2020-11-01 00:00:00,46000,HR
4,NaN,41.0,eric@domain.com,2022-05-19 00:00:00,51000,Finance
5,Mark X,38.0,markx@example.com,NaN,54000,SALES
6,Tim Cook,32.6,tim@apple.com,2021-01-01 00:00:00,NaN,Tech
7,Lara Croft,33.0,NaN,2019-03-25 00:00:00,49000,archaeology
8,Jack Ryan,29.0,jack@ryan.com,2020-03-03 00:00:00,52000,Intelligence
9,Nina,25.0,nina@,2021-08-08 00:00:00,47000,HR
10,John Doe,29.0,john@example.com,2021-06-15 00:00:00,50000,Sales
11,Mike,32.6,mike@mail.com,07/14/2022,50000,Engineering
12,NaN,32.6,NaN,NaN,NaN,NaN
13,Sam,32.0,sam@sam.com,2020-01-20 00:00:00,48000,SALES
14,Ben,45.0,ben@example.com,2021-07-15 00:00:00,51000,sales
15,Linda,32.6,linda@workplace.com,2022.09.09,53000,Tech
16,Gary,31.0,gary@nowhere.com,2020-10-10 00:00:00,fifty-two,HR
17,Clark,37.0,clark@kent.com,2023-01-15 00:00:00,57000,Superheroes
18,Diana,28.0,diana@themyscira.com,2021-05-05 00:00:00,56000,Superheroes
19,Peter,30.0,peter@parker.com,2020-12-12 00:00:00,51000,NaN

In [80]:
de["Age"] = de["Age"].astype("int")

In [81]:
de

,Name,Age,Email,Join_Date,Salary,Department
0,John Doe,29,john@example.com,2021-06-15 00:00:00,50000,Sales
1,Jane Smith,32,jane.smith@mail.com,2020-12-06 00:00:00,52000,HR
2,Bob,35,bobmail.com,2022-08-15 00:00:00,"$48,000",marketing
3,Alice Lee,27,alice@lee.com,2020-11-01 00:00:00,46000,HR
4,NaN,41,eric@domain.com,2022-05-19 00:00:00,51000,Finance
5,Mark X,38,markx@example.com,NaN,54000,SALES
6,Tim Cook,32,tim@apple.com,2021-01-01 00:00:00,NaN,Tech
7,Lara Croft,33,NaN,2019-03-25 00:00:00,49000,archaeology
8,Jack Ryan,29,jack@ryan.com,2020-03-03 00:00:00,52000,Intelligence
9,Nina,25,nina@,2021-08-08 00:00:00,47000,HR
10,John Doe,29,john@example.com,2021-06-15 00:00:00,50000,Sales
11,Mike,32,mike@mail.com,07/14/2022,50000,Engineering
12,NaN,32,NaN,NaN,NaN,NaN
13,Sam,32,sam@sam.com,2020-01-20 00:00:00,48000,SALES
14,Ben,45,ben@example.com,2021-07-15 00:00:00,51000,sales
15,Linda,32,linda@workplace.com,2022.09.09,53000,Tech
16,Gary,31,gary@nowhere.com,2020-10-10 00:00:00,fifty-two,HR
17,Clark,37,clark@kent.com,2023-01-15 00:00:00,57000,Superheroes
18,Diana,28,diana@themyscira.com,2021-05-05 00:00:00,56000,Superheroes
19,Peter,30,peter@parker.com,2020-12-12 00:00:00,51000,NaN

In [82]:
de["Email"]=de["Email"].fillna("abc@gmail.com")

In [83]:
de

,Name,Age,Email,Join_Date,Salary,Department
0,John Doe,29,john@example.com,2021-06-15 00:00:00,50000,Sales
1,Jane Smith,32,jane.smith@mail.com,2020-12-06 00:00:00,52000,HR
2,Bob,35,bobmail.com,2022-08-15 00:00:00,"$48,000",marketing
3,Alice Lee,27,alice@lee.com,2020-11-01 00:00:00,46000,HR
4,NaN,41,eric@domain.com,2022-05-19 00:00:00,51000,Finance
5,Mark X,38,markx@example.com,NaN,54000,SALES
6,Tim Cook,32,tim@apple.com,2021-01-01 00:00:00,NaN,Tech
7,Lara Croft,33,abc@gmail.com,2019-03-25 00:00:00,49000,archaeology
8,Jack Ryan,29,jack@ryan.com,2020-03-03 00:00:00,52000,Intelligence
9,Nina,25,nina@,2021-08-08 00:00:00,47000,HR
10,John Doe,29,john@example.com,2021-06-15 00:00:00,50000,Sales
11,Mike,32,mike@mail.com,07/14/2022,50000,Engineering
12,NaN,32,abc@gmail.com,NaN,NaN,NaN
13,Sam,32,sam@sam.com,2020-01-20 00:00:00,48000,SALES
14,Ben,45,ben@example.com,2021-07-15 00:00:00,51000,sales
15,Linda,32,linda@workplace.com,2022.09.09,53000,Tech
16,Gary,31,gary@nowhere.com,2020-10-10 00:00:00,fifty-two,HR
17,Clark,37,clark@kent.com,2023-01-15 00:00:00,57000,Superheroes
18,Diana,28,diana@themyscira.com,2021-05-05 00:00:00,56000,Superheroes
19,Peter,30,peter@parker.com,2020-12-12 00:00:00,51000,NaN

In [84]:
de["Join_Date"] = pd.to_datetime(de["Join_Date"],errors="coerce")

In [85]:
de

          Name  Age                 Email  Join_Date     Salary    Department
0     John Doe   29      john@example.com 2021-06-15      50000         Sales
1   Jane Smith   32   jane.smith@mail.com 2020-12-06      52000            HR
2          Bob   35           bobmail.com 2022-08-15    $48,000     marketing
3    Alice Lee   27         alice@lee.com 2020-11-01      46000            HR
4          NaN   41       eric@domain.com 2022-05-19      51000       Finance
5       Mark X   38     markx@example.com        NaT      54000         SALES
6     Tim Cook   32         tim@apple.com 2021-01-01        NaN          Tech
7   Lara Croft   33         abc@gmail.com 2019-03-25      49000   archaeology
8    Jack Ryan   29         jack@ryan.com 2020-03-03      52000  Intelligence
9         Nina   25                 nina@ 2021-08-08      47000            HR
10    John Doe   29      john@example.com 2021-06-15      50000         Sales
11        Mike   32         mike@mail.com 2022-07-14      50000   Engineering
12         NaN   32         abc@gmail.com        NaT        NaN           NaN
13         Sam   32           sam@sam.com 2020-01-20      48000         SALES
14         Ben   45       ben@example.com 2021-07-15      51000         sales
15       Linda   32   linda@workplace.com 2022-09-09      53000          Tech
16        Gary   31      gary@nowhere.com 2020-10-10  fifty-two            HR
17       Clark   37        clark@kent.com 2023-01-15      57000   Superheroes
18       Diana   28  diana@themyscira.com 2021-05-05      56000   Superheroes
19       Peter   30      peter@parker.com 2020-12-12      51000           NaN

In [86]:
de["Join_Date"].ffill(inplace=True)

In [87]:
de

          Name  Age                 Email  Join_Date     Salary    Department
0     John Doe   29      john@example.com 2021-06-15      50000         Sales
1   Jane Smith   32   jane.smith@mail.com 2020-12-06      52000            HR
2          Bob   35           bobmail.com 2022-08-15    $48,000     marketing
3    Alice Lee   27         alice@lee.com 2020-11-01      46000            HR
4          NaN   41       eric@domain.com 2022-05-19      51000       Finance
5       Mark X   38     markx@example.com 2022-05-19      54000         SALES
6     Tim Cook   32         tim@apple.com 2021-01-01        NaN          Tech
7   Lara Croft   33         abc@gmail.com 2019-03-25      49000   archaeology
8    Jack Ryan   29         jack@ryan.com 2020-03-03      52000  Intelligence
9         Nina   25                 nina@ 2021-08-08      47000            HR
10    John Doe   29      john@example.com 2021-06-15      50000         Sales
11        Mike   32         mike@mail.com 2022-07-14      50000   Engineering
12         NaN   32         abc@gmail.com 2022-07-14        NaN           NaN
13         Sam   32           sam@sam.com 2020-01-20      48000         SALES
14         Ben   45       ben@example.com 2021-07-15      51000         sales
15       Linda   32   linda@workplace.com 2022-09-09      53000          Tech
16        Gary   31      gary@nowhere.com 2020-10-10  fifty-two            HR
17       Clark   37        clark@kent.com 2023-01-15      57000   Superheroes
18       Diana   28  diana@themyscira.com 2021-05-05      56000   Superheroes
19       Peter   30      peter@parker.com 2020-12-12      51000           NaN

In [88]:
de["Salary"] = de["Salary"].astype("str").str.replace(r"[/$,]","",regex=True)

In [89]:
de

          Name  Age                 Email  Join_Date     Salary    Department
0     John Doe   29      john@example.com 2021-06-15      50000         Sales
1   Jane Smith   32   jane.smith@mail.com 2020-12-06      52000            HR
2          Bob   35           bobmail.com 2022-08-15      48000     marketing
3    Alice Lee   27         alice@lee.com 2020-11-01      46000            HR
4          NaN   41       eric@domain.com 2022-05-19      51000       Finance
5       Mark X   38     markx@example.com 2022-05-19      54000         SALES
6     Tim Cook   32         tim@apple.com 2021-01-01        nan          Tech
7   Lara Croft   33         abc@gmail.com 2019-03-25      49000   archaeology
8    Jack Ryan   29         jack@ryan.com 2020-03-03      52000  Intelligence
9         Nina   25                 nina@ 2021-08-08      47000            HR
10    John Doe   29      john@example.com 2021-06-15      50000         Sales
11        Mike   32         mike@mail.com 2022-07-14      50000   Engineering
12         NaN   32         abc@gmail.com 2022-07-14        nan           NaN
13         Sam   32           sam@sam.com 2020-01-20      48000         SALES
14         Ben   45       ben@example.com 2021-07-15      51000         sales
15       Linda   32   linda@workplace.com 2022-09-09      53000          Tech
16        Gary   31      gary@nowhere.com 2020-10-10  fifty-two            HR
17       Clark   37        clark@kent.com 2023-01-15      57000   Superheroes
18       Diana   28  diana@themyscira.com 2021-05-05      56000   Superheroes
19       Peter   30      peter@parker.com 2020-12-12      51000           NaN

In [91]:
de["Salary"] = pd.to_numeric(de["Salary"],errors="coerce")

In [92]:
de

          Name  Age                 Email  Join_Date   Salary    Department
0     John Doe   29      john@example.com 2021-06-15  50000.0         Sales
1   Jane Smith   32   jane.smith@mail.com 2020-12-06  52000.0            HR
2          Bob   35           bobmail.com 2022-08-15  48000.0     marketing
3    Alice Lee   27         alice@lee.com 2020-11-01  46000.0            HR
4          NaN   41       eric@domain.com 2022-05-19  51000.0       Finance
5       Mark X   38     markx@example.com 2022-05-19  54000.0         SALES
6     Tim Cook   32         tim@apple.com 2021-01-01      NaN          Tech
7   Lara Croft   33         abc@gmail.com 2019-03-25  49000.0   archaeology
8    Jack Ryan   29         jack@ryan.com 2020-03-03  52000.0  Intelligence
9         Nina   25                 nina@ 2021-08-08  47000.0            HR
10    John Doe   29      john@example.com 2021-06-15  50000.0         Sales
11        Mike   32         mike@mail.com 2022-07-14  50000.0   Engineering
12         NaN   32         abc@gmail.com 2022-07-14      NaN           NaN
13         Sam   32           sam@sam.com 2020-01-20  48000.0         SALES
14         Ben   45       ben@example.com 2021-07-15  51000.0         sales
15       Linda   32   linda@workplace.com 2022-09-09  53000.0          Tech
16        Gary   31      gary@nowhere.com 2020-10-10      NaN            HR
17       Clark   37        clark@kent.com 2023-01-15  57000.0   Superheroes
18       Diana   28  diana@themyscira.com 2021-05-05  56000.0   Superheroes
19       Peter   30      peter@parker.com 2020-12-12  51000.0           NaN

In [93]:
de["Salary"] = de["Salary"].fillna(de["Salary"].min())

In [94]:
de

          Name  Age                 Email  Join_Date   Salary    Department
0     John Doe   29      john@example.com 2021-06-15  50000.0         Sales
1   Jane Smith   32   jane.smith@mail.com 2020-12-06  52000.0            HR
2          Bob   35           bobmail.com 2022-08-15  48000.0     marketing
3    Alice Lee   27         alice@lee.com 2020-11-01  46000.0            HR
4          NaN   41       eric@domain.com 2022-05-19  51000.0       Finance
5       Mark X   38     markx@example.com 2022-05-19  54000.0         SALES
6     Tim Cook   32         tim@apple.com 2021-01-01  46000.0          Tech
7   Lara Croft   33         abc@gmail.com 2019-03-25  49000.0   archaeology
8    Jack Ryan   29         jack@ryan.com 2020-03-03  52000.0  Intelligence
9         Nina   25                 nina@ 2021-08-08  47000.0            HR
10    John Doe   29      john@example.com 2021-06-15  50000.0         Sales
11        Mike   32         mike@mail.com 2022-07-14  50000.0   Engineering
12         NaN   32         abc@gmail.com 2022-07-14  46000.0           NaN
13         Sam   32           sam@sam.com 2020-01-20  48000.0         SALES
14         Ben   45       ben@example.com 2021-07-15  51000.0         sales
15       Linda   32   linda@workplace.com 2022-09-09  53000.0          Tech
16        Gary   31      gary@nowhere.com 2020-10-10  46000.0            HR
17       Clark   37        clark@kent.com 2023-01-15  57000.0   Superheroes
18       Diana   28  diana@themyscira.com 2021-05-05  56000.0   Superheroes
19       Peter   30      peter@parker.com 2020-12-12  51000.0           NaN

In [95]:
de["Salary"] = de["Salary"].astype("int")

In [96]:
de

          Name  Age                 Email  Join_Date  Salary    Department
0     John Doe   29      john@example.com 2021-06-15   50000         Sales
1   Jane Smith   32   jane.smith@mail.com 2020-12-06   52000            HR
2          Bob   35           bobmail.com 2022-08-15   48000     marketing
3    Alice Lee   27         alice@lee.com 2020-11-01   46000            HR
4          NaN   41       eric@domain.com 2022-05-19   51000       Finance
5       Mark X   38     markx@example.com 2022-05-19   54000         SALES
6     Tim Cook   32         tim@apple.com 2021-01-01   46000          Tech
7   Lara Croft   33         abc@gmail.com 2019-03-25   49000   archaeology
8    Jack Ryan   29         jack@ryan.com 2020-03-03   52000  Intelligence
9         Nina   25                 nina@ 2021-08-08   47000            HR
10    John Doe   29      john@example.com 2021-06-15   50000         Sales
11        Mike   32         mike@mail.com 2022-07-14   50000   Engineering
12         NaN   32         abc@gmail.com 2022-07-14   46000           NaN
13         Sam   32           sam@sam.com 2020-01-20   48000         SALES
14         Ben   45       ben@example.com 2021-07-15   51000         sales
15       Linda   32   linda@workplace.com 2022-09-09   53000          Tech
16        Gary   31      gary@nowhere.com 2020-10-10   46000            HR
17       Clark   37        clark@kent.com 2023-01-15   57000   Superheroes
18       Diana   28  diana@themyscira.com 2021-05-05   56000   Superheroes
19       Peter   30      peter@parker.com 2020-12-12   51000           NaN

In [97]:
de["Department"] = de["Department"].fillna("IT")

In [98]:
de

          Name  Age                 Email  Join_Date  Salary    Department
0     John Doe   29      john@example.com 2021-06-15   50000         Sales
1   Jane Smith   32   jane.smith@mail.com 2020-12-06   52000            HR
2          Bob   35           bobmail.com 2022-08-15   48000     marketing
3    Alice Lee   27         alice@lee.com 2020-11-01   46000            HR
4          NaN   41       eric@domain.com 2022-05-19   51000       Finance
5       Mark X   38     markx@example.com 2022-05-19   54000         SALES
6     Tim Cook   32         tim@apple.com 2021-01-01   46000          Tech
7   Lara Croft   33         abc@gmail.com 2019-03-25   49000   archaeology
8    Jack Ryan   29         jack@ryan.com 2020-03-03   52000  Intelligence
9         Nina   25                 nina@ 2021-08-08   47000            HR
10    John Doe   29      john@example.com 2021-06-15   50000         Sales
11        Mike   32         mike@mail.com 2022-07-14   50000   Engineering
12         NaN   32         abc@gmail.com 2022-07-14   46000            IT
13         Sam   32           sam@sam.com 2020-01-20   48000         SALES
14         Ben   45       ben@example.com 2021-07-15   51000         sales
15       Linda   32   linda@workplace.com 2022-09-09   53000          Tech
16        Gary   31      gary@nowhere.com 2020-10-10   46000            HR
17       Clark   37        clark@kent.com 2023-01-15   57000   Superheroes
18       Diana   28  diana@themyscira.com 2021-05-05   56000   Superheroes
19       Peter   30      peter@parker.com 2020-12-12   51000            IT

In [99]:
de.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        18 non-null     object
 1   Age         20 non-null     int32
 2   Email       20 non-null     object
 3   Join_Date   20 non-null     datetime64[ns]
 4   Salary      20 non-null     int32
 5   Department  20 non-null     object
dtypes: datetime64[ns](1), int32(2), object(3)
memory usage: 932.0+ bytes

In [100]:
de.isnull().sum()

Name          2
Age           0
Email         0
Join_Date     0
Salary        0
Department    0
dtype: int64

In [101]:
de = de.dropna()

In [103]:
de.isnull().sum()

Name          0
Age           0
Email         0
Join_Date     0
Salary        0
Department    0
dtype: int64